
## Plan Result (dev)

[CI link](https://github.com/iret-h-ota/tfaction-sample/actions/runs/12556957110)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 46 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.network_apne1.module.vpc.aws_default_network_acl.this[0]
  * module.network_apne1.module.vpc.aws_default_route_table.default[0]
  * module.network_apne1.module.vpc.aws_default_security_group.this[0]
  * module.network_apne1.module.vpc.aws_eip.nat[0]
  * module.network_apne1.module.vpc.aws_internet_gateway.this[0]
  * module.network_apne1.module.vpc.aws_nat_gateway.this[0]
  * module.network_apne1.module.vpc.aws_route.private_nat_gateway[0]
  * module.network_apne1.module.vpc.aws_route.public_internet_gateway[0]
  * module.network_apne1.module.vpc.aws_route_table.private[0]
  * module.network_apne1.module.vpc.aws_route_table.public[0]
  * module.network_apne1.module.vpc.aws_route_table_association.private[0]
  * module.network_apne1.module.vpc.aws_route_table_association.private[1]
  * module.network_apne1.module.vpc.aws_route_table_association.private[2]
  * module.network_apne1.module.vpc.aws_route_table_association.public[0]
  * module.network_apne1.module.vpc.aws_route_table_association.public[1]
  * module.network_apne1.module.vpc.aws_route_table_association.public[2]
  * module.network_apne1.module.vpc.aws_subnet.private[0]
  * module.network_apne1.module.vpc.aws_subnet.private[1]
  * module.network_apne1.module.vpc.aws_subnet.private[2]
  * module.network_apne1.module.vpc.aws_subnet.public[0]
  * module.network_apne1.module.vpc.aws_subnet.public[1]
  * module.network_apne1.module.vpc.aws_subnet.public[2]
  * module.network_apne1.module.vpc.aws_vpc.this[0]
  * module.network_apne3.module.vpc.aws_default_network_acl.this[0]
  * module.network_apne3.module.vpc.aws_default_route_table.default[0]
  * module.network_apne3.module.vpc.aws_default_security_group.this[0]
  * module.network_apne3.module.vpc.aws_eip.nat[0]
  * module.network_apne3.module.vpc.aws_internet_gateway.this[0]
  * module.network_apne3.module.vpc.aws_nat_gateway.this[0]
  * module.network_apne3.module.vpc.aws_route.private_nat_gateway[0]
  * module.network_apne3.module.vpc.aws_route.public_internet_gateway[0]
  * module.network_apne3.module.vpc.aws_route_table.private[0]
  * module.network_apne3.module.vpc.aws_route_table.public[0]
  * module.network_apne3.module.vpc.aws_route_table_association.private[0]
  * module.network_apne3.module.vpc.aws_route_table_association.private[1]
  * module.network_apne3.module.vpc.aws_route_table_association.private[2]
  * module.network_apne3.module.vpc.aws_route_table_association.public[0]
  * module.network_apne3.module.vpc.aws_route_table_association.public[1]
  * module.network_apne3.module.vpc.aws_route_table_association.public[2]
  * module.network_apne3.module.vpc.aws_subnet.private[0]
  * module.network_apne3.module.vpc.aws_subnet.private[1]
  * module.network_apne3.module.vpc.aws_subnet.private[2]
  * module.network_apne3.module.vpc.aws_subnet.public[0]
  * module.network_apne3.module.vpc.aws_subnet.public[1]
  * module.network_apne3.module.vpc.aws_subnet.public[2]
  * module.network_apne3.module.vpc.aws_vpc.this[0]
* Delete
  * aws_s3_bucket.sample


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.sample will be destroyed
  # (because aws_s3_bucket.sample is not in configuration)
  - resource "aws_s3_bucket" "sample" {
      - arn                         = "arn:aws:s3:::tfaction-sample-dev-s3-2" -> null
      - bucket                      = "tfaction-sample-dev-s3-2" -> null
      - bucket_domain_name          = "tfaction-sample-dev-s3-2.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "tfaction-sample-dev-s3-2.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "tfaction-sample-dev-s3-2" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "created_by" = "h-ota"
          - "managed_by" = "terraform"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "1ca06a48b4f796bede8a3016789a7c8ad0b18a671d261adfee4a7d75349fb6b5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.network_apne1.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "tfaction-sample-dev-acl-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-acl-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.network_apne1.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "tfaction-sample-dev-rt-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-rt-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network_apne1.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tfaction-sample-dev-sg-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-sg-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "tfaction-sample-dev-ngw-eip"
        }
      + tags_all             = {
          + "Name"       = "tfaction-sample-dev-ngw-eip"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tfaction-sample-dev-igw"
        }
      + tags_all = {
          + "Name"       = "tfaction-sample-dev-igw"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "tfaction-sample-dev-ngw"
        }
      + tags_all                           = {
          + "Name"       = "tfaction-sample-dev-ngw"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
    }

  # module.network_apne1.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network_apne1.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network_apne1.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tfaction-sample-dev-rt-private"
        }
      + tags_all         = {
          + "Name"       = "tfaction-sample-dev-rt-private"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tfaction-sample-dev-rt-public"
        }
      + tags_all         = {
          + "Name"       = "tfaction-sample-dev-rt-public"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-a"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-a"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-c"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-c"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-d"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-d"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-a"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-a"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-c"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-c"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.64.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-d"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-d"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne1.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.64.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tfaction-sample-dev-vpc"
        }
      + tags_all                             = {
          + "Name"       = "tfaction-sample-dev-vpc"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
    }

  # module.network_apne3.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "tfaction-sample-dev-acl-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-acl-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.network_apne3.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "tfaction-sample-dev-rt-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-rt-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network_apne3.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tfaction-sample-dev-sg-default"
        }
      + tags_all               = {
          + "Name"       = "tfaction-sample-dev-sg-default"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "tfaction-sample-dev-ngw-eip"
        }
      + tags_all             = {
          + "Name"       = "tfaction-sample-dev-ngw-eip"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tfaction-sample-dev-igw"
        }
      + tags_all = {
          + "Name"       = "tfaction-sample-dev-igw"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "tfaction-sample-dev-ngw"
        }
      + tags_all                           = {
          + "Name"       = "tfaction-sample-dev-ngw"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
    }

  # module.network_apne3.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network_apne3.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network_apne3.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tfaction-sample-dev-rt-private"
        }
      + tags_all         = {
          + "Name"       = "tfaction-sample-dev-rt-private"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tfaction-sample-dev-rt-public"
        }
      + tags_all         = {
          + "Name"       = "tfaction-sample-dev-rt-public"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-a"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-a"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-b"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-b"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-private-c"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-private-c"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-a"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-a"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-b"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-b"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-3c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.65.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tfaction-sample-dev-subnet-public-c"
        }
      + tags_all                                       = {
          + "Name"       = "tfaction-sample-dev-subnet-public-c"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network_apne3.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.65.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tfaction-sample-dev-vpc"
        }
      + tags_all                             = {
          + "Name"       = "tfaction-sample-dev-vpc"
          + "created_by" = "h-ota"
          + "managed_by" = "terraform"
        }
    }

Plan: 46 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"a79e21ebdce4e44e906fc9edab5f8a9a9d04bd92","Target":"dev","Vars":{},"WorkflowName":"CI"} -->